#+TITLE: Evaluation of risk of removing this package
#+AUTHOR: Merchise Autrement [~ยบ/~]
#+DESCRIPTION: Detailed discussion about the risk of removing this module in 1.8.x


* Who uses '[[file:../monads][xoutil.fp.monads]]'?

  #+begin_src sh
  find ../../ -type f -name '*.py' -exec grep --color -i -nH -e 'fp.*monads' {} +
  #+end_src

  #+RESULTS:
  #+begin_example
  ../../fp/monads/abc.py:4:# xoutil.fp.monads.abc
  ../../fp/monads/__init__.py:4:# xoutil.fp.monads
  ../../fp/monads/option.py:4:# xoutil.fp.monads.option
  ../../fp/params/__init__.py:146:    `~xoutil.fp.monads.option.Maybe`:class:\ .
  ../../fp/params/__init__.py:149:    from xoutil.fp.monads.option import Just, Wrong, take
  ../../fp/prove/semantic.py:102:        from xoutil.fp.monads.option import Just, Wrong
  ../../fp/prove/semantic.py:147:        from xoutil.fp.monads.option import Wrong
  ../../fp/prove/semantic.py:171:        from xoutil.fp.monads.option import Just
  ../../fp/prove/semantic.py:211:        from xoutil.fp.monads.option import Wrong
  ../../fp/prove/semantic.py:265:        from xoutil.fp.monads.option import Just, Wrong
  ../../fp/prove/semantic.py:290:        from xoutil.fp.monads.option import Wrong
  ../../fp/prove/semantic.py:312:        from xoutil.fp.monads.option import Just, Wrong, none
  ../../fp/prove/__init__.py:21:  an special false value.  See `~xoutil.fp.monads.option.Maybe`:class: monad
  ../../fp/prove/__init__.py:56:    return an instance of `~xoutil.fp.monads.option.Maybe`:class:.
  ../../fp/prove/__init__.py:60:    from xoutil.fp.monads.option import Maybe, Just, Wrong
  ../../fp/prove/__init__.py:97:    from xoutil.fp.monads.option import Just, Wrong
  ../../params.py:156:        from xoutil.fp.monads.option import Just, Wrong, none
  ../../params.py:227:        from xoutil.fp.monads.option import none
  ../../params.py:301:        from xoutil.fp.monads.option import none
  ../../params.py:317:        from xoutil.fp.monads.option import none
  ../../params.py:391:            from xoutil.fp.monads.option import Wrong
  ../../params.py:421:            from xoutil.fp.monads.option import Wrong
  #+end_example
